Tekla.Structures.Drawing.Surfacing.Flags.ShowPattern
Show pattern

Tekla.Structures.Drawing.Surfacing.Flags.HiddenLines
Hidden lines

Tekla.Structures.Drawing.Surfacing.Flags.OwnHiddenLines
Own hidden lines